src/data_analysis/collected_data/watermelon/api/standardb16ms/h/load.txt
Running 30m test @ http://20.117.74.48:60
  2 threads and 1000 connections
  Thread calibration: mean lat.: 10.061ms, rate sampling interval: 34ms
  Thread calibration: mean lat.: 10.078ms, rate sampling interval: 35ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     2.15s     2.31s   10.15s    88.38%
    Req/Sec     1.00k   285.96     1.71k    81.81%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.62s 
 75.000%    3.09s 
 90.000%    4.73s 
 99.000%   10.15s 
 99.900%   22.07s 
 99.990%   28.79s 
 99.999%   34.34s 
100.000%   37.72s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.098     0.000000            1         1.00
      14.743     0.100000       353541         1.11
     335.103     0.200000       707073         1.25
     742.911     0.300000      1060820         1.43
    1167.359     0.400000      1414459         1.67
    1624.063     0.500000      1767793         2.00
    1871.871     0.550000      1944956         2.22
    2136.063     0.600000      2122268         2.50
    2420.735     0.650000      2298576         2.86
    2736.127     0.700000      2474618         3.33
    3094.527     0.750000      2651406         4.00
    3295.231     0.775000      2740552         4.44
    3512.319     0.800000      2828355         5.00
    3756.031     0.825000      2916726         5.71
    4028.415     0.850000      3005014         6.67
    4345.855     0.875000      3093812         8.00
    4526.079     0.887500      3137772         8.89
    4726.783     0.900000      3181688        10.00
    4956.159     0.912500      3226396        11.43
    5214.207     0.925000      3270149        13.33
    5521.407     0.937500      3314236        16.00
    5701.631     0.943750      3336563        17.78
    5906.431     0.950000      3358729        20.00
    6139.903     0.956250      3380718        22.86
    6414.335     0.962500      3402537        26.67
    6762.495     0.968750      3424846        32.00
    6967.295     0.971875      3435712        35.56
    7208.959     0.975000      3446765        40.00
    7499.775     0.978125      3457833        45.71
    7868.415     0.981250      3468834        53.33
    8380.415     0.984375      3479869        64.00
    8724.479     0.985938      3485399        71.11
    9158.655     0.987500      3490919        80.00
    9723.903     0.989062      3496432        91.43
   10485.759     0.990625      3501955       106.67
   11640.831     0.992188      3507507       128.00
   12353.535     0.992969      3510267       142.22
   13139.967     0.993750      3513015       160.00
   13983.743     0.994531      3515770       182.86
   14917.631     0.995313      3518550       213.33
   15990.783     0.996094      3521301       256.00
   16580.607     0.996484      3522680       284.44
   17268.735     0.996875      3524070       320.00
   17940.479     0.997266      3525447       365.71
   18644.991     0.997656      3526834       426.67
   19447.807     0.998047      3528196       512.00
   19890.175     0.998242      3528894       568.89
   20365.311     0.998437      3529573       640.00
   20905.983     0.998633      3530263       731.43
   21495.807     0.998828      3530958       853.33
   22134.783     0.999023      3531642      1024.00
   22495.231     0.999121      3531996      1137.78
   22888.447     0.999219      3532339      1280.00
   23347.199     0.999316      3532682      1462.86
   23822.335     0.999414      3533032      1706.67
   24363.007     0.999512      3533369      2048.00
   24657.919     0.999561      3533548      2275.56
   24985.599     0.999609      3533718      2560.00
   25444.351     0.999658      3533886      2925.71
   25886.719     0.999707      3534059      3413.33
   26427.391     0.999756      3534233      4096.00
   26689.535     0.999780      3534320      4551.11
   26951.679     0.999805      3534410      5120.00
   27230.207     0.999829      3534491      5851.43
   27639.807     0.999854      3534579      6826.67
   28098.559     0.999878      3534665      8192.00
   28442.623     0.999890      3534708      9102.22
   28868.607     0.999902      3534750     10240.00
   29278.207     0.999915      3534794     11702.86
   29704.191     0.999927      3534837     13653.33
   30130.175     0.999939      3534879     16384.00
   30392.319     0.999945      3534901     18204.44
   30703.615     0.999951      3534923     20480.00
   31031.295     0.999957      3534943     23405.71
   31440.895     0.999963      3534966     27306.67
   31653.887     0.999969      3534987     32768.00
   31817.727     0.999973      3534997     36408.89
   32014.335     0.999976      3535008     40960.00
   32260.095     0.999979      3535019     46811.43
   32686.079     0.999982      3535030     54613.33
   33259.519     0.999985      3535041     65536.00
   33619.967     0.999986      3535048     72817.78
   33882.111     0.999988      3535051     81920.00
   34177.023     0.999989      3535057     93622.86
   34603.007     0.999991      3535062    109226.67
   35094.527     0.999992      3535069    131072.00
   35127.295     0.999993      3535070    145635.56
   35586.047     0.999994      3535073    163840.00
   35782.655     0.999995      3535076    187245.71
   36012.031     0.999995      3535078    218453.33
   36110.335     0.999996      3535081    262144.00
   36241.407     0.999997      3535082    291271.11
   36339.711     0.999997      3535084    327680.00
   36405.247     0.999997      3535085    374491.43
   36470.783     0.999998      3535088    436906.67
   36470.783     0.999998      3535088    524288.00
   36470.783     0.999998      3535088    582542.22
   36503.551     0.999998      3535089    655360.00
   36765.695     0.999999      3535091    748982.86
   36765.695     0.999999      3535091    873813.33
   36765.695     0.999999      3535091   1048576.00
   36765.695     0.999999      3535091   1165084.44
   36798.463     0.999999      3535092   1310720.00
   36798.463     0.999999      3535092   1497965.71
   36798.463     0.999999      3535092   1747626.67
   36929.535     1.000000      3535093   2097152.00
   36929.535     1.000000      3535093   2330168.89
   36929.535     1.000000      3535093   2621440.00
   36929.535     1.000000      3535093   2995931.43
   36929.535     1.000000      3535093   3495253.33
   37715.967     1.000000      3535094   4194304.00
   37715.967     1.000000      3535094          inf
#[Mean    =     2152.718, StdDeviation   =     2313.387]
#[Max     =    37683.200, Total count    =      3535094]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  3553914 requests in 30.00m, 1.62GB read
  Socket errors: connect 0, read 1563, write 7797, timeout 16276
  Non-2xx or 3xx responses: 6
Requests/sec:   1974.38
Transfer/sec:      0.92MB